## Plan Result (543: prod_frontdoor - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 1 to destroy.</code></pre>

* Create
  * module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0]
* Update
  * module.premium_front_door.azapi_update_resource.frontdoor_system_identity
* Replace
  * module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.premium_front_door.azapi_update_resource.frontdoor_system_identity will be updated in-place
  ~ resource "azapi_update_resource" "frontdoor_system_identity" {
      ~ body                    = jsonencode(
          ~ {
              ~ identity = {
                  ~ type = "None" -> "SystemAssigned"
                }
            }
        )
        id                      = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/lz-prod-rg/providers/Microsoft.Cdn/profiles/sdshmcts-prod"
        name                    = "sdshmcts-prod"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.premium_front_door.azurerm_key_vault_access_policy.frontdoor_premium_kv_access[0] will be created
  + resource "azurerm_key_vault_access_policy" "frontdoor_premium_kv_access" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod"
      + object_id               = (known after apply)
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = (known after apply)
    }

  # module.premium_front_door.azurerm_role_assignment.frontdoor_premium_kv_access[0] must be replaced
-/+ resource "azurerm_role_assignment" "frontdoor_premium_kv_access" {
      + condition_version                      = (known after apply)
      ~ id                                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/resourceGroups/sds-platform-prod-rg/providers/Microsoft.KeyVault/vaults/acmedtssdsprod/providers/Microsoft.Authorization/roleAssignments/ee4b3a61-16ef-113f-4738-e0a5d46e1bfd" -> (known after apply)
      ~ name                                   = "ee4b3a61-16ef-113f-4738-e0a5d46e1bfd" -> (known after apply)
      ~ principal_id                           = "5dd7b622-dc97-480b-be3c-c976e8d5659f" -> (known after apply) # forces replacement
      ~ principal_type                         = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id                     = "/subscriptions/5ca62022-6aa2-4cee-aaa7-e7536c8d566c/providers/Microsoft.Authorization/roleDefinitions/4633458b-17de-408a-b874-0445c86b69e6" -> (known after apply)
      + skip_service_principal_aad_check       = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":537,"Program":"tfcmt","SHA1":"","Target":"543: prod_frontdoor - TerraformPlanApply","Vars":{}} -->